iTower_20__GIS_Управление_пространственными_данными/src/BusinessProcesses/лм_БизнесПроцесс/лм_БизнесПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>лм_БизнесПроцесс</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>BusinessProcessRef.лм_БизнесПроцесс</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительОжидаетЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТочкиВхода</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Итерация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <comment>Объект системы, &quot;по поводу&quot; которого был создан бизнес-процесс.</comment>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <comment>Результат выполнения задания после завершения бизнес-процесса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>История переписки исполнителя и проверяющего</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/лм_ВерсииКартыМаршрута/лм_ВерсииКартыМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лм_ВерсииКартыМаршрута</name>
  <resources>
    <name>КартаМаршрута</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/лм_ВыполнениеБизнесПроцессов/лм_ВыполнениеБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лм_ВыполнениеБизнесПроцессов</name>
  <resources>
    <name>Активная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.лм_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТочки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТочкиВхода</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Итерация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/лм_ТочкиБизнесПроцессов/лм_ТочкиБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лм_ТочкиБизнесПроцессов</name>
  <resources>
    <name>ШаблонПодпроцесса</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </resources>
  <resources>
    <name>ОжидатьЗавершенияПодпроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТипТочки</name>
    <type>
      <types>EnumRef.лм_ТипыТочекБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеУсловия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиАвтоподстановки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСвойства</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Групповая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОповещений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПередСтартом</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПослеСтарта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПослеЗавершения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторТочки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/лм_СценарииБизнесПроцессов/лм_СценарииБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лм_СценарииБизнесПроцессов</name>
  <attributes>
    <name>НаименованиеВыхода</name>
    <comment>Имеет смысл, если исходная точка является точкой действия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВарианта</name>
    <comment>Имеет смысл, если исходная точка является точкой выбора варианта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеВыполнено</name>
    <comment>Имеет смысл, если исходная точка является точкой условия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИконкаДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЭлементаСхемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикПослеЗавершения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.лм_ШаблоныБизнесПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходнаяТочка</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонечнаяТочка</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/BusinessProcesses/лм_БизнесПроцесс/Forms/ФормаБизнесПроцесса/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Элементы.ГруппаРодитель.Видимость = ЗначениеЗаполнено(Объект.Родитель);
	Элементы.НадписьРодительОжидаетЗавершения.Видимость = Объект.РодительОжидаетЗавершения И НЕ Объект.Завершен;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// НачалоЗамераПроизводительности
НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
// Конец НачалоЗамераПроизводительности
	
	ОбновитьКартуМаршрута();
	
	// ЗавершениеЗамераПроизводительности
ОценкаПроизводительности.ЗакончитьЗамерВремени("Бизнес-процесс.ОткрытиеФормыПроцесса", НачалоЗамера);
// Конец ЗавершениеЗамераПроизводительности	
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартуМаршрута()
	
	ЗаписьКарты = РегистрыСведений.лм_ВерсииКартыМаршрута.СоздатьМенеджерЗаписи();
	ЗаписьКарты.Шаблон = Объект.Шаблон;
	ЗаписьКарты.НомерВерсии = Объект.НомерВерсии;
	ЗаписьКарты.Прочитать();
	КартаМаршрута = ЗаписьКарты.КартаМаршрута.Получить();
	ЭлементыКарты = КартаМаршрута.ЭлементыГрафическойСхемы;
	
	ЦветФона = Новый Цвет(255, 255, 255);
	ЦветЛинии = Новый Цвет(0, 0, 0);
	Линия = Новый Линия(ТипСоединительнойЛинии.Сплошная, 2);
	ЛинияАктивной = Новый Линия(ТипСоединительнойЛинии.Пунктир, 2);
		
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	лм_ВыполнениеБизнесПроцессов.ИдентификаторТочки КАК ИдентификаторТочки,
	               |	лм_ТочкиБизнесПроцессов.ИмяТочки КАК ИмяТочки,
	               |	лм_СценарииБизнесПроцессов.НаименованиеВыхода КАК НаименованиеВыхода,
	               |	лм_СценарииБизнесПроцессов.НаименованиеВарианта КАК НаименованиеВарианта,
	               |	лм_СценарииБизнесПроцессов.УсловиеВыполнено КАК УсловиеВыполнено,
	               |	лм_ВыполнениеБизнесПроцессов.ИдентификаторТочкиВхода КАК ИдентификаторТочкиВхода,
	               |	лм_ТочкиВхода.ИмяТочки КАК ИмяТочкиВхода,
	               |	лм_ВыполнениеБизнесПроцессов.Активная КАК Активная,
	               |	лм_ВыполнениеБизнесПроцессов.Итерация КАК Итерация
	               |ИЗ
	               |	РегистрСведений.лм_ВыполнениеБизнесПроцессов КАК лм_ВыполнениеБизнесПроцессов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лм_ТочкиБизнесПроцессов КАК лм_ТочкиБизнесПроцессов
	               |		ПО лм_ВыполнениеБизнесПроцессов.ИдентификаторТочки = лм_ТочкиБизнесПроцессов.ИдентификаторТочки
	               |			И (лм_ТочкиБизнесПроцессов.НомерВерсии = &НомерВерсии)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лм_ТочкиБизнесПроцессов КАК лм_ТочкиВхода
	               |		ПО лм_ВыполнениеБизнесПроцессов.ИдентификаторТочкиВхода = лм_ТочкиВхода.ИдентификаторТочки
	               |			И (лм_ТочкиВхода.НомерВерсии = &НомерВерсии)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.лм_СценарииБизнесПроцессов КАК лм_СценарииБизнесПроцессов
	               |		ПО лм_ВыполнениеБизнесПроцессов.ИдентификаторТочки = лм_СценарииБизнесПроцессов.КонечнаяТочка
	               |			И лм_ВыполнениеБизнесПроцессов.ИдентификаторТочкиВхода = лм_СценарииБизнесПроцессов.ИсходнаяТочка
	               |			И (лм_СценарииБизнесПроцессов.НомерВерсии = &НомерВерсии)
	               |ГДЕ
	               |	лм_ВыполнениеБизнесПроцессов.БизнесПроцесс = &БизнесПроцесс
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Активная";
	Запрос.УстановитьПараметр("БизнесПроцесс", Объект.Ссылка);
	Запрос.УстановитьПараметр("НомерВерсии", Объект.НомерВерсии);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ВыполненныеПереходы = Новый ТаблицаЗначений();
	ВыполненныеПереходы.Колонки.Добавить("ИмяТочки", Новый ОписаниеТипов("Строка"));
	ВыполненныеПереходы.Колонки.Добавить("ИмяТочкиВхода", Новый ОписаниеТипов("Строка"));
	ВыполненныеПереходы.Колонки.Добавить("НаименованиеВыхода", Новый ОписаниеТипов("Строка"));
	ВыполненныеПереходы.Колонки.Добавить("НаименованиеВарианта", Новый ОписаниеТипов("Строка"));
	
	Пока Выборка.Следующий() Цикл
		ИмяТочки = Выборка.ИмяТочки;
		СтрокаПерехода = ВыполненныеПереходы.Добавить();
		СтрокаПерехода.ИмяТочки = ИмяТочки;
		СтрокаПерехода.ИмяТочкиВхода = Выборка.ИмяТочкиВхода;
		СтрокаПерехода.НаименованиеВыхода = Выборка.НаименованиеВыхода;
		СтрокаПерехода.НаименованиеВарианта = Выборка.НаименованиеВарианта;
		
		Если НЕ ПустаяСтрока(ИмяТочки) Тогда			
			ЭлементТочки = ЭлементыКарты.Найти(ИмяТочки);
			Если ЭлементТочки <> Неопределено Тогда
				ЭлементТочки.ЦветФона = ЦветФона; 
				ЭлементТочки.ЦветРамки = ЦветЛинии;
				Если Выборка.Активная Тогда
					ЭлементТочки.Рамка = ЛинияАктивной;
				Иначе
					ЭлементТочки.Рамка = Линия;
					Если ТипЗнч(ЭлементТочки) = Тип("ЭлементГрафическойСхемыДействие") Тогда
						ЭлементТочки.Картинка = БиблиотекаКартинок.Успешно;
					ИначеЕсли ТипЗнч(ЭлементТочки) = Тип("ЭлементГрафическойСхемыВыборВарианта") Тогда
						Для Каждого ЭлементВарианта Из ЭлементТочки.Элементы Цикл
							ЭлементВарианта.ЦветФона = ЦветФона;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСвязи Из ЭлементыКарты Цикл
		Если (ТипЗнч(ЭлементСвязи) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния")
				ИЛИ ТипЗнч(ЭлементСвязи) = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния")) Тогда				
			ДанныеПерехода = Новый Структура();
			ДанныеПерехода.Вставить("ИмяТочки", ЭлементСвязи.КонецЭлемент.Имя);
			ДанныеПерехода.Вставить("ИмяТочкиВхода", ЭлементСвязи.НачалоЭлемент.Имя);
			Если ТипЗнч(ЭлементСвязи.НачалоЭлемент) = Тип("ЭлементГрафическойСхемыВыборВарианта") Тогда			
				ДанныеПерехода.Вставить("НаименованиеВарианта", ЭлементСвязи.НачалоВариант.Наименование);
			ИначеЕсли ТипЗнч(ЭлементСвязи.НачалоЭлемент) = Тип("ЭлементГрафическойСхемыДействие") Тогда
				ДанныеПерехода.Вставить("НаименованиеВыхода", ЭлементСвязи.Наименование);
			КонецЕсли;
			НайденныеСтроки = ВыполненныеПереходы.НайтиСтроки(ДанныеПерехода);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				ЭлементСвязи.Линия = Линия;
				ЭлементСвязи.ЦветЛинии = ЦветЛинии;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
